young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotB/libraries/drivers/inc/at32f422_426_adc.h
  __IO uint32_t reserved1[8];
  
  /**
  * @brief adc misc register, offset:0x70
  */
  union
  {
    __IO uint32_t misc1;
    struct
    {
      __IO uint32_t xeoc_sm              : 1; /* [0] */
      __IO uint32_t reserved1            : 3; /* [3:1] */
      __IO uint32_t tcfapen              : 1; /* [4] */
      __IO uint32_t reserved2            : 3; /* [7:5] */
      __IO uint32_t tcfaps               : 1; /* [8] */
      __IO uint32_t reserved3            : 23;/* [31:9] */
    } misc1_bit;
  };
  
  /**
  * @brief adc misc2 register, offset:0x74
  */
  union
  {
    __IO uint32_t misc2;
    struct
    {
      __IO uint32_t otcf                 : 1; /* [0] */
      __IO uint32_t ptcf                 : 1; /* [1] */
      __IO uint32_t osnf                 : 4; /* [5:2] */
      __IO uint32_t reserved1            : 1; /* [6] */
      __IO uint32_t psnf                 : 2; /* [8:7] */
      __IO uint32_t reserved2            : 23;/* [31:9] */
    } misc2_bit;
  };
} adc_type;

/**
  * @}
  */

#define ADC1                             ((adc_type *) ADC1_BASE)

/** @defgroup ADC_exported_functions
  * @{
  */

void adc_reset(adc_type *adc_x);
void adc_enable(adc_type *adc_x, confirm_state new_state);
void adc_base_default_para_init(adc_base_config_type *adc_base_struct);
void adc_base_config(adc_type *adc_x, adc_base_config_type *adc_base_struct);
void adc_dma_mode_enable(adc_type *adc_x, confirm_state new_state);
void adc_interrupt_enable(adc_type *adc_x, uint32_t adc_int, confirm_state new_state);
void adc_calibration_init(adc_type *adc_x);
flag_status adc_calibration_init_status_get(adc_type *adc_x);
void adc_calibration_start(adc_type *adc_x);
flag_status adc_calibration_status_get(adc_type *adc_x);
void adc_voltage_monitor_enable(adc_type *adc_x, adc_voltage_monitoring_type adc_voltage_monitoring);
void adc_voltage_monitor_threshold_value_set(adc_type *adc_x, uint16_t adc_high_threshold, uint16_t adc_low_threshold);
void adc_voltage_monitor_single_channel_select(adc_type *adc_x, adc_channel_select_type adc_channel);
void adc_ordinary_channel_set(adc_type *adc_x, adc_channel_select_type adc_channel, uint8_t adc_sequence, adc_sampletime_select_type adc_sampletime);
void adc_preempt_channel_length_set(adc_type *adc_x, uint8_t adc_channel_lenght);
void adc_preempt_channel_set(adc_type *adc_x, adc_channel_select_type adc_channel, uint8_t adc_sequence, adc_sampletime_select_type adc_sampletime);
void adc_ordinary_conversion_trigger_set(adc_type *adc_x, adc_ordinary_trig_select_type adc_ordinary_trig, confirm_state new_state);
void adc_preempt_conversion_trigger_set(adc_type *adc_x, adc_preempt_trig_select_type adc_preempt_trig, confirm_state new_state);
void adc_preempt_offset_value_set(adc_type *adc_x, adc_preempt_channel_type adc_preempt_channel, uint16_t adc_offset_value);
void adc_ordinary_part_count_set(adc_type *adc_x, uint8_t adc_channel_count);
void adc_ordinary_part_mode_enable(adc_type *adc_x, confirm_state new_state);
void adc_preempt_part_mode_enable(adc_type *adc_x, confirm_state new_state);
void adc_preempt_auto_mode_enable(adc_type *adc_x, confirm_state new_state);
void adc_tempersensor_vintrv_enable(confirm_state new_state);
void adc_ordinary_software_trigger_enable(adc_type *adc_x, confirm_state new_state);
flag_status adc_ordinary_software_trigger_status_get(adc_type *adc_x);
void adc_preempt_software_trigger_enable(adc_type *adc_x, confirm_state new_state);
flag_status adc_preempt_software_trigger_status_get(adc_type *adc_x);
uint16_t adc_ordinary_conversion_data_get(adc_type *adc_x);
uint16_t adc_preempt_conversion_data_get(adc_type *adc_x, adc_preempt_channel_type adc_preempt_channel);
flag_status adc_flag_get(adc_type *adc_x, uint16_t adc_flag);
flag_status adc_interrupt_flag_get(adc_type *adc_x, uint16_t adc_flag);
void adc_flag_clear(adc_type *adc_x, uint16_t adc_flag);
void adc_conversion_stop(adc_type *adc_x);
flag_status adc_conversion_stop_status_get(adc_type *adc_x);
void adc_convert_fail_auto_abort_enable(adc_type *adc_x, confirm_state new_state);
void adc_xeoc_sync_mode_set(adc_type *adc_x, adc_xeoc_sync_type xeoc_sync_mode);
void adc_fail_auto_processing_enale(adc_type *adc_x, confirm_state new_state);
void adc_fail_auto_processing_mode_set(adc_type *adc_x, adc_fail_auto_processing_mode_type fail_auto_processing_mode);
uint16_t adc_conversion_fail_sequence_number_get(adc_type *adc_x, uint32_t adc_group_number);
void adc_conversion_fail_sequence_number_clear(adc_type *adc_x, uint32_t adc_group_number);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
